---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelWallProjection
source: html/d41b6f55-c6af-948f-6ed6-fba81ae3e0e4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelWallProjection Property

"z Projection"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelWallProjection { get; }
```